# ðŸ¼ Pandas Index Management ðŸ—‚ï¸

## â¬‡ï¸ Load Data

The first step is to load our data to examine and manage its index.

In [1]:
# Importing Libraries

import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Specify the file format explicitly
dataset = load_dataset('csv', data_files='D:/Udemy/Luke/Data Analysis Mastering/Python for Data Analytics/DataSets/data_jobs.csv')
df = dataset['train'].to_pandas()

# Data Cleanup

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

d:\anaconda3\envs\haroun_env\Lib\site-packages\requests\__init__.py:86: RequestsDependencyWarning: Unable to find acceptable character detection dependency (chardet or charset_normalizer).
  warnings.warn(

### ðŸ·ï¸ Index Attributes

#### ðŸ“ Notes
> You can get or set properties of the index, such as its name or data type.
> - It's helpful for maintaining metadata ðŸ”– or ensuring index compatibility in operations ðŸ§©.
> - (`.name`, `.dtype`)
>   - `.name` ðŸ·ï¸: The name of the index.
>   - `.dtype` ðŸ”¢: The data type of the index.

Now, let's take a look at our DataFrame. ðŸ‘€

In [2]:
df.sample(3)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
283393,Data Engineer,Data Engineer - CCM Squad,"Auckland, New Zealand",via Indeed,Full-time,False,New Zealand,2023-09-22 07:53:44,True,False,New Zealand,None,NaN,NaN,ASB Bank,"['sql', 'python', 'sql server', 'snowflake', '...","{'cloud': ['snowflake'], 'databases': ['sql se..."
654936,Data Engineer,AWS Data Engineer,Anywhere,via LinkedIn,Full-time,True,Sudan,2023-08-13 10:31:11,True,False,Sudan,None,NaN,NaN,Dice,"['aws', 'spark']","{'cloud': ['aws'], 'libraries': ['spark']}"
402456,Software Engineer,SAS Programmer,"Brussels, Belgium",via Emplois Trabajo.org,Full-time,False,Belgium,2023-04-29 18:27:34,True,False,Belgium,None,NaN,NaN,The AKKAdemy,"['sas', 'sas', 'sql', 'sap']","{'analyst_tools': ['sas', 'sap'], 'programming..."

Let's inspect our index.

In [3]:
df.index

RangeIndex(start=0, stop=785741, step=1)

In [4]:
df.index.dtype

dtype('int64')

Our index is a range of numbers, inspecting the name...

In [5]:
df.index.name

It has no name... so let's name it.

In [6]:
df.index.name = 'job_index'

Inspecting it.

In [7]:
df.index.name

'job_index'

In [8]:
df.sample(3)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
job_index,,,,,,,,,,,,,,,,,
200488,Data Analyst,Online Data Analyst,Anywhere,via LinkedIn,Part-time,True,Hong Kong,2023-03-10 15:48:44,True,False,Hong Kong,None,NaN,NaN,TELUS International,['go'],{'programming': ['go']}
87637,Data Engineer,Data Engineer III - Databricks,"Framingham, MA",via Mendeley,Full-time,False,"New York, United States",2023-08-24 00:06:20,False,True,United States,None,NaN,NaN,The Lancet,"['sql', 'shell', 'python', 'databricks', 'snow...","{'cloud': ['databricks', 'snowflake', 'oracle'..."
144735,Data Engineer,"Req. for the post Data Engineer II, Indirect S...","Hyderabad, Telangana, India",via Shine.com,Full-time,False,India,2023-04-24 08:14:19,True,False,India,None,NaN,NaN,Amazon,"['c++', 'c#', 'java', 'python', 'golang', 'pow...","{'programming': ['c++', 'c#', 'java', 'python'..."

### Example 2
Remember the pivot table we made in the last example? Where we got median yearly salaries for the different job titles. Let's run that code. Then we'll get the index name and the data type of the index using df.index.name and df.index.dtype.

In [9]:
median_pivot = df.pivot_table(values='salary_year_avg' , index='job_title_short' , aggfunc='median')
median_pivot

                           salary_year_avg
job_title_short
Business Analyst                   85000.0
Cloud Engineer                     90000.0
Data Analyst                       90000.0
Data Engineer                     125000.0
Data Scientist                    127500.0
Machine Learning Engineer         106415.0
Senior Data Analyst               111175.0
Senior Data Engineer              147500.0
Senior Data Scientist             155500.0
Software Engineer                  99150.0

In [10]:
index_name = median_pivot.index.name
index_name

'job_title_short'

In [11]:
index_dtype = median_pivot.index.dtype
index_dtype

dtype('O')

### reset_index()

**Notes**
- reset_index(): Resets the DataFrameâ€™s index to the default integer index. This is particularly useful after operations that alter the index, like sorting or filtering, to simplify further data manipulation.

**Example 1**

When we create new DataFrames by filtering this jacks up our index!

In [12]:
df_usa = df[df['job_country'] == 'United States']
df_usa.head(5)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
job_index,,,,,,,,,,,,,,,,,
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,NaN,NaN,Boehringer Ingelheim,None,None
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,NaN,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
5,Data Engineer,GCP Data Engineer,Anywhere,via ZipRecruiter,Contractor and Temp work,True,Georgia,2023-11-07 14:01:59,False,False,United States,None,NaN,NaN,smart folks inc,"['python', 'sql', 'gcp']","{'cloud': ['gcp'], 'programming': ['python', '..."
6,Senior Data Engineer,Senior Data Engineer - GCP Cloud,"Dearborn, MI",via LinkedIn,Full-time,False,"Florida, United States",2023-03-27 13:18:18,False,False,United States,None,NaN,NaN,"Miracle Software Systems, Inc","['sql', 'python', 'java', 'sql server', 'gcp',...","{'cloud': ['gcp', 'bigquery'], 'databases': ['..."
9,Data Scientist,Data Scientist II,Anywhere,via ZipRecruiter,Full-time,True,"New York, United States",2023-04-23 13:02:57,False,False,United States,None,NaN,NaN,"Radwell International, LLC","['sql', 'python', 'r', 'mongodb', 'mongodb', '...","{'analyst_tools': ['excel'], 'cloud': ['azure'..."

In [13]:
df_usa.index

Index([     0,      3,      5,      6,      9,     11,     13,     17,     26,
           27,
       ...
       785625, 785626, 785641, 785648, 785651, 785673, 785685, 785692, 785703,
       785705],
      dtype='int64', name='job_index', length=206292)

Index is no longer correctly spaced by 1 increment.

In [14]:
df_usa.reset_index(inplace=True)
df_usa.head(5)

,job_index,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,NaN,NaN,Boehringer Ingelheim,None,None
1,3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,NaN,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
2,5,Data Engineer,GCP Data Engineer,Anywhere,via ZipRecruiter,Contractor and Temp work,True,Georgia,2023-11-07 14:01:59,False,False,United States,None,NaN,NaN,smart folks inc,"['python', 'sql', 'gcp']","{'cloud': ['gcp'], 'programming': ['python', '..."
3,6,Senior Data Engineer,Senior Data Engineer - GCP Cloud,"Dearborn, MI",via LinkedIn,Full-time,False,"Florida, United States",2023-03-27 13:18:18,False,False,United States,None,NaN,NaN,"Miracle Software Systems, Inc","['sql', 'python', 'java', 'sql server', 'gcp',...","{'cloud': ['gcp', 'bigquery'], 'databases': ['..."
4,9,Data Scientist,Data Scientist II,Anywhere,via ZipRecruiter,Full-time,True,"New York, United States",2023-04-23 13:02:57,False,False,United States,None,NaN,NaN,"Radwell International, LLC","['sql', 'python', 'r', 'mongodb', 'mongodb', '...","{'analyst_tools': ['excel'], 'cloud': ['azure'..."

### ðŸ¤” To Drop or Not to Drop?

> Technically, we could use **.drop()** ðŸ—‘ï¸ to remove the `job_index` column.
>
> **BUT** âš ï¸, if we wanted to perform **merge operations** ðŸ”— in the future with our original DataFrame, this `job_index` serves as a crucial **unique ID** ðŸ”‘ to do that.

---

### **Example 2** ðŸ”„

> Let's return to our main DataFrame ðŸ“Š with the job postings. We are going to **reset the index** of the pivot table so that `job_title_short` is no longer the index.

In [15]:
median_pivot.reset_index(inplace=True)
median_pivot

             job_title_short  salary_year_avg
0           Business Analyst          85000.0
1             Cloud Engineer          90000.0
2               Data Analyst          90000.0
3              Data Engineer         125000.0
4             Data Scientist         127500.0
5  Machine Learning Engineer         106415.0
6        Senior Data Analyst         111175.0
7       Senior Data Engineer         147500.0
8      Senior Data Scientist         155500.0
9          Software Engineer          99150.0

In [16]:
df_usa.set_index('job_index', inplace=True)

df_usa.head()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
job_index,,,,,,,,,,,,,,,,,
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,NaN,NaN,Boehringer Ingelheim,None,None
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,NaN,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
5,Data Engineer,GCP Data Engineer,Anywhere,via ZipRecruiter,Contractor and Temp work,True,Georgia,2023-11-07 14:01:59,False,False,United States,None,NaN,NaN,smart folks inc,"['python', 'sql', 'gcp']","{'cloud': ['gcp'], 'programming': ['python', '..."
6,Senior Data Engineer,Senior Data Engineer - GCP Cloud,"Dearborn, MI",via LinkedIn,Full-time,False,"Florida, United States",2023-03-27 13:18:18,False,False,United States,None,NaN,NaN,"Miracle Software Systems, Inc","['sql', 'python', 'java', 'sql server', 'gcp',...","{'cloud': ['gcp', 'bigquery'], 'databases': ['..."
9,Data Scientist,Data Scientist II,Anywhere,via ZipRecruiter,Full-time,True,"New York, United States",2023-04-23 13:02:57,False,False,United States,None,NaN,NaN,"Radwell International, LLC","['sql', 'python', 'r', 'mongodb', 'mongodb', '...","{'analyst_tools': ['excel'], 'cloud': ['azure'..."

**Example 2**

Now that we've reset our index we can set the new index on another column like salary_year_avg.

In [17]:
median_pivot.set_index('job_title_short', inplace=True)
median_pivot

                           salary_year_avg
job_title_short
Business Analyst                   85000.0
Cloud Engineer                     90000.0
Data Analyst                       90000.0
Data Engineer                     125000.0
Data Scientist                    127500.0
Machine Learning Engineer         106415.0
Senior Data Analyst               111175.0
Senior Data Engineer              147500.0
Senior Data Scientist             155500.0
Software Engineer                  99150.0

### ðŸ“ˆ sort_index()

#### ðŸ“ Notes
> `sort_index()`: Sorts the DataFrame by the index (row labels), either ascending or descending. ðŸ”„
> - This helps in quickly organizing data by the index. ðŸ—‚ï¸
> - It's often used after `set_index()`.

#### âœ… Example
Back to our pivoted DataFrame ðŸ“Š, let's sort this new index alphabetically ðŸ”¤.

In [20]:
median_pivot.sort_index(inplace=True)
median_pivot

                           salary_year_avg
job_title_short
Business Analyst                   85000.0
Cloud Engineer                     90000.0
Data Analyst                       90000.0
Data Engineer                     125000.0
Data Scientist                    127500.0
Machine Learning Engineer         106415.0
Senior Data Analyst               111175.0
Senior Data Engineer              147500.0
Senior Data Scientist             155500.0
Software Engineer                  99150.0